INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Анора (Anora)', 'Стриптизерша Анора немного говорит по-русски, поэтому владелец нью-йоркского клуба представляет ее Ване Захарову — сыну российского олигарха. Ваня приглашает Анору в роскошный дом отца, платит девушке за ее компанию, неожиданно признается в любви и даже предлагает выйти замуж. Проживая историю Золушки, девушка очаровывается Ваней, его свободой и деньгами. Свадьба для нее — билет в новую жизнь. А для инфантильного парня — способ получить американское гражданство. Но идиллия рушится, когда о свадьбе узнают родители Вани.',
2020, 1, 18, 139, 1);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Дюна: Часть вторая (Dune: Part Two)', 'После событий первого фильма Пол и Джессика Атрейдесы скрываются в пустыне. Местные верят, что Пол — избранный из пророчества. В это время коварные Харконнены ведут затяжную войну с фрименами.',
2021, 5, 16, 166, 2);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Падение империи (Civil War)', 'Президент США, вопреки Конституции, решает остаться на третий срок — и в стране начинается Гражданская война. Объединенные силы Техаса и Калифорнии, а также армия Флориды и западных штатов вот-вот доберутся до Вашингтона и свергнут правителя.
Военная корреспондентка Ли вместе с коллегой Джоэлом хотят добраться до президента раньше всех, чтобы сфотографировать его и взять интервью. С ними увязывается молодая амбициозная фотограф Джесси.',
2022, 4, 21, 109, 3);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Зона интересов (Zone of Interest)', 'Рудольф Хесс руководит концентрационным лагерем Освенцим и живет прямо около его высоких стен. Но в доме семьи ничего не напоминает об ужасах Холокоста: жена ухаживает за красивым садом, дети ходят купаться на реку, слуги выполняют все прихоти хозяев. Даже когда Хесса хотят перевести на другую работу, супруга отказывается переезжать: ведь большое комфортное жилье — все, о чем они мечтали с молодости.',
2023, 2, 18, 105, 4);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Претенденты (Challengers)', 'У теннисиста Арта Дональдсона черная полоса в карьере: он позорно проигрывает в последнем матче и страдает от нехватки уверенности. Чтобы исправить положение, тренер и по совместительству супруга Таши заявляет спортсмена отправиться на небольшой локальный турнир. В финале Арт встречается со своим старым другом Патриком — у троицы история любовного треугольника длиною в жизнь. Так местечковое соревнование превращается в битву за честь и принципы.',
2024, 1, 0, 131, 5);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Субстанция (Substance)', 'Актриса Элизабет Спаркл ведет телепередачу о занятиях аэробикой — помогает зрительницам приводить тело в порядок. Но как только героине исполняется 50 лет, продюсеры выставляют ее за дверь и начинают искать ей молодую замену.
Изнывая от ненависти к себе, возрасту и телу, Элизабет решается на радикальное омоложение. После инъекции загадочной «Субстанции» ее позвоночник разрывается. Из женщины вылупляется молодая красотка Сью. Согласно инструкции, им нужно меняться местами каждую неделю и помнить, что они — единое целое. Но все идет не по плану. Погоня за молодостью и любовью окружающих приводит обеих к кошмарным последствиям.',
2023, 4, 21, 141, 6);
INSERT INTO films(name, description, "year", genre_id, minimal_age, duration_in_minutes, file_id)
VALUES ('Дикий робот (The Wild Robot)', 'Посылка с роботом-помощником ROZZUM 7134 падает на необитаемый остров. Тщетно пытаясь найти задания, которые можно выполнить, робот выучивает язык животных и по наставлению опытной мамы-опоссума начинает заботиться о крохотном гусёнке, чью семью он случайно раздавил. В консультанты к нему набивается «специалист по гусям» хитрый лис Финк, с которым никто не хочет дружить.',
2022, 3, 6, 102, 7);